
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"df181f1853fef28000b8a4dbb298fab952f6d22508866d28fa8e1ae226c60058\"" -> "W/\"c8d0d5e36a17afbfcee24203f10c02b36337352e111c21f5cf4c62c62542ca9c\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"eca42c56b2c231c0fa318e254e5b8934c4d4169ebe3d61c5eaabe023e7118925\"" -> "W/\"b853e5a9938524b817d7d7652aedb1af819d903ebb45f178c36199dcb3bf453d\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"6c14671a72dfc7bc6d9426589c9b0d0b38faf74c33c4b887c48e1c9fef8db0fb\"" -> "W/\"a247f17751a03a86fbd3dcc2da3b4dc2f68959fc967c9daa7c19b638bff5bd61\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"0b9259b65f4d7b6477b8ebc33e169e7de15550e672b2c3f2cc74ea89fe7e6a13\"" -> "W/\"f9a5f5b56364caccda664a46c6577c9f19819baf244f5b076fd7f99635d43eac\""
        id                          = "template-template"
        name                        = "template-template"
        # (29 unchanged attributes hidden)
    }

  # local_file.hello_world has been deleted
  - resource "local_file" "hello_world" {
      - content              = "Hello, World!" -> null
      - content_base64sha256 = "3/1gIbsr1bCvZ2KQgJ7DpTGR3YHH9wpLKGiKNiGCmG8=" -> null
      - content_base64sha512 = "N015SpXNz9izWZMYX++bo2jxYNja9DLQi6nx7R5avmzGkpHg+i/gAGpSVw7xjBne9OYXwzzlLvCm5fvjGMsDhw==" -> null
      - content_md5          = "65a8e27d8879283831b664bd8b7f0ad4" -> null
      - content_sha1         = "0a0a9f2a6772942557ab5355d76af442f8f65e01" -> null
      - content_sha256       = "dffd6021bb2bd5b0af676290809ec3a53191dd81c7f70a4b28688a362182986f" -> null
      - content_sha512       = "374d794a95cdcfd8b35993185fef9ba368f160d8daf432d08ba9f1ed1e5abe6cc69291e0fa2fe0006a52570ef18c19def4e617c33ce52ef0a6e5fbe318cb0387" -> null
      - directory_permission = "0777" -> null
      - file_permission      = "0777" -> null
      - filename             = "./hello_world.txt" -> null
      - id                   = "0a0a9f2a6772942557ab5355d76af442f8f65e01" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.settings_all["kong-development"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"c8d0d5e36a17afbfcee24203f10c02b36337352e111c21f5cf4c62c62542ca9c\"" -> null
      - full_name                   = "gh-org-template/kong-development" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-development.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-development" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-development.git" -> null
      - id                          = "kong-development" -> null
      - is_template                 = false -> null
      - name                        = "kong-development" -> null
      - node_id                     = "R_kgDOMkD9FQ" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843119893 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-development.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-development" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["kong-openssl"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"b853e5a9938524b817d7d7652aedb1af819d903ebb45f178c36199dcb3bf453d\"" -> null
      - full_name                   = "gh-org-template/kong-openssl" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-openssl.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-openssl" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-openssl.git" -> null
      - id                          = "kong-openssl" -> null
      - is_template                 = false -> null
      - name                        = "kong-openssl" -> null
      - node_id                     = "R_kgDOMkeCGA" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843547160 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-openssl.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-openssl" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["kong-runtime"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"a247f17751a03a86fbd3dcc2da3b4dc2f68959fc967c9daa7c19b638bff5bd61\"" -> null
      - full_name                   = "gh-org-template/kong-runtime" -> null
      - git_clone_url               = "git://github.com/gh-org-template/kong-runtime.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/kong-runtime" -> null
      - http_clone_url              = "https://github.com/gh-org-template/kong-runtime.git" -> null
      - id                          = "kong-runtime" -> null
      - is_template                 = false -> null
      - name                        = "kong-runtime" -> null
      - node_id                     = "R_kgDOMkeCAw" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 843547139 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/kong-runtime.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/kong-runtime" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "gh-org-template" -> null
          - repository           = "template-1-github-release" -> null
        }
    }

  # github_repository.settings_all["template-template"] will be destroyed
  # (because github_repository.settings_all is not in configuration)
  - resource "github_repository" "settings_all" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = false -> null
      - allow_squash_merge          = false -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"f9a5f5b56364caccda664a46c6577c9f19819baf244f5b076fd7f99635d43eac\"" -> null
      - full_name                   = "gh-org-template/template-template" -> null
      - git_clone_url               = "git://github.com/gh-org-template/template-template.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/gh-org-template/template-template" -> null
      - http_clone_url              = "https://github.com/gh-org-template/template-template.git" -> null
      - id                          = "template-template" -> null
      - is_template                 = true -> null
      - name                        = "template-template" -> null
      - node_id                     = "R_kgDOMkeCEQ" -> null
      - primary_language            = "Makefile" -> null
      - private                     = false -> null
      - repo_id                     = 843547153 -> null
      - ssh_clone_url               = "git@github.com:gh-org-template/template-template.git" -> null
      - svn_url                     = "https://github.com/gh-org-template/template-template" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
      - web_commit_signoff_required = false -> null
    }

  # local_file.hello_world will be created
  + resource "local_file" "hello_world" {
      + content              = "Hello, World!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./hello_world.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 4 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->